# SheetNumberDuplicated Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SheetFailures..::..SheetNumberDuplicated Property
BuiltInFailures..::..SheetFailures Class See Also
---
Sheet Number is already in use. Enter a unique number.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SheetNumberDuplicated { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetNumberDuplicated As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SheetNumberDuplicated {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SheetFailures Class
Autodesk.Revit.DB Namespace